tutorials4NF/unsteadyStateNaturalConvection4NF/mixedConvectionMonoHomogenous/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    circle
    {
        type            movingRotatingWallVelocity;
        centre          (0 0 0);
        axis            (0 0 1);
        rpm             -6.82e-5;//Re=10, omega=rad/s
        value           uniform (0 0 0);
    }

    ".*"
    {
	type		fixedValue;
	value		uniform (0 0 0);
    }
}


// ************************************************************************* //
